# Красницкий Дмитрий Олегович
# 3 курс ИСИТ ЗФ
# Task Integer 27

import random
week_days = {
    1: 'понедельник',
    2: 'вторник',
    3: 'среда',
    4: 'четверг',
    5: 'пятница',
    6: 'суббота',
    7: 'воскресенье'
}
K = random.randrange(1,366)
K = 31
i = (1+4)%7 + 1
print("1-е января: ", 1)
print("Номер дня недели: ", i)
print("День недели:",week_days[i])
i = (K+4)%7 + 1
print()
print("Номер дня года: ", K)
print("Номер дня недели: ", i)
print("День недели:",week_days[i])